handler: procedure options (main);
   declare i fixed binary (31);
   declare (start_time, finish_time) float (18);
   on attention begin;
      finish_time = secs();
      put skip list ('elapsed time =', finish_time - start_time, 'secs');
      stop;
   end;

   start_time = secs();
   do i = 1 by 1;
      delay (500);
      put skip list (i);
   end;
end handler;
