-- 11 Nov 2025
include Setting

say 'BIOINFORMATICS/BASE COUNT'
say version
say
dna='CGTAAAAAATTACAACGTCCTTTGGCTATCTCTTAAACTCCTGCTAAATG',
||  'CTCGTGCTTTCCAATTATGTAAGCGTTCCGAGACGGGGTGGTCGATTCTG',
||  'AGGACAAAGGTCAAGATGGAGCGCATCGAACGCAATAAGGATCATTTGAT',
||  'GGGACGTTTCGTCGACAAAGTCTTGTTTCGAGAGTAACGGCTACCGTCTT',
||  'CGATTCTGCTTATAACACTATGTTCTTATGAAATGGATGTTCTGAGTTGG',
||  'TCAGTCCCAATGTGCGGGGTTTCTTTTAGTACGTCGGGAGTGGTATTATA',
||  'TTTAATTTTTCTATATAGCGATCTGTATTTAAGCAATTCATTTAGGTTAT',
||  'CGCCGCGATGCTCGGTTCGGACCGCCAAGCATCTGGCTCCACTGCTAGTG',
||  'TCCTAAATTTGAATGGCAAACACAAATAAGATTTAGCAATTCGTGTAGAC',
||  'GACCGGGGACTTGCATGATGGGAGCAGCTTTGTTAAACTACGAACGTAAT'
len=Length(dna); c=0
do i=1 by 3 to len
   codon=Substr(dna,i,3)
   call Charout ,codon' '
   c+=1
   if c//10=0 then
      say
end i
say; say
say 'A' Countstr('A',dna)
say 'C' Countstr('C',dna)
say 'G' Countstr('G',dna)
say 'T' Countstr('T',dna)
say
say 'Total' len
exit

include Abend
