-- 23 Aug 2025
include Setting

say '10001TH PRIME'
say version
say
call Primes -10001
say prim.10001
say Format(Time('e'),,3) 'seconds'
exit

include Math
