declare 1 RS232_layout,
   2 Carrier_Detect       Bit(1),
   2 Received_Data        Bit(1),
   2 Transmitted_Data     Bit(1),
   2 Data_Terminal_ready  Bit(1),
   2 Signal_Ground        Bit(1),
   2 Data_Set_Ready       Bit(1),
   2 Request_To_Send      Bit(1),
   2 Clear_To_Send        Bit(1),
   2 Ring_Indicator       Bit(1);
