/*REXX example uses the   SortStrings   subroutine  with optional args. */
                            /*···define array (@.nnn) of strings here···*/
call sortStrings  'Reverse=no'  3
                                       /*stick a fork in it, we're done.*/
