   declare countries character (20) varying controlled;
   allocate countries initial ('Britain');
   allocate countries initial ('America');
   allocate countries initial ('Argentina');
