/*REXX program to examine which operating system that REXX is running under. */

parse source opSys howInvoked pathName

/*where  opSys  will indicate which operating system REXX is running under, and */
/*from that, one could make assumptions what the wordsize is, etc.              */
