call  beep(freq [,duration])        /*supported (kinda) by Regina.      */

call sound(freq [,duration ])       /*supported by PC/REXX.             */

say '07'x                           /*works under the Windows DOS shell.*/

say copies('07'x,100)               /*as above, but much more annoying. */
