IDENTIFICATION DIVISION.
PROGRAM-ID. LOOP-1p5-NOADV.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  I    PIC 99 VALUE 1.
01	IDISP	PIC Z9.
PROCEDURE DIVISION.
	PERFORM FOREVER
		MOVE I TO IDISP
		DISPLAY FUNCTION TRIM(IDISP) WITH NO ADVANCING
		IF I = 10
			EXIT PERFORM
		END-IF
		DISPLAY ", " WITH NO ADVANCING
		ADD 1 TO I
	END-PERFORM.
	STOP RUN.
	END-PROGRAM.
