IDENTIFICATION DIVISION.
PROGRAM-ID. LOOP-1p5-NOADV-VARY.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  I    	PIC 99  VALUE 1.
	88	END-LIST	VALUE 10.
01	I-OUT	PIC Z9.
PROCEDURE DIVISION.
	PERFORM WITH TEST AFTER VARYING I FROM 1 BY 1 UNTIL END-LIST
		MOVE I TO I-OUT
		DISPLAY FUNCTION TRIM(I-OUT) WITH NO ADVANCING
		IF NOT END-LIST
			DISPLAY ", " WITH NO ADVANCING
		END-IF
	END-PERFORM.
	STOP RUN.
	END-PROGRAM.
