declare text character (1000) varying, line_no fixed;

get (line_no);
on endfile (f) begin;
  put skip list ('the specified line does not exist');
  go to next;
end;

get file (f) edit ((text do i = 1 to line_no)) (L);

put skip list (text);
next: ;
