declare 1 u union,
          2 c character (1),
          2 i fixed binary (8) unsigned;
c = 'a'; put skip list (i); /* prints 97  */
i = 97;  put skip list (c); /* prints 'a' */
