/*REXX program to demonstrate a  DO  UNTIL  construction.               */

          do v=1  until  v//6==0
          say v
          end
                                       /*stick a fork in it, we're done.*/
