/*REXX program to demonstrate a  DO  UNTIL  construction.               */

v=0
          do  until  v//6 == 0
          v=v+1
          say v
          end
                                       /*stick a fork in it, we're done.*/
