ffr: procedure (n) returns (fixed binary(31));
   declare n fixed binary (31);
   declare v(2*n+1) bit(1);
   declare (i, j) fixed binary (31);
   declare (r, s) fixed binary (31);

   v = '0'b;
   v(1) = '1'b;

   if n = 1 then return (1);

   r = 1;
   do i = 2 to n;
      do j = 2 to 2*n;
         if v(j) = '0'b then leave;
      end;
      v(j) = '1'b;
      s = j;
      r = r + s;
      if r <= 2*n then v(r) = '1'b;
   end;
   return (r);
end ffr;
