01  a PIC X(20).      *> a is a string of 20 characters.
01  b PIC 9(10).      *> b is a 10-digit integer.
01  c PIC 9(10)V9(5). *> c is a decimal number with a 10-digit integral part and a 5-digit fractional part.
01  d PIC 99/99/99.   *> d is an edited number, with a slash between each pair of digits in a 6-digit integer.
