u = .unknown~new
u~foo(1, 2, 3)

::class unknown
::method unknown
  use arg name, args
  say "Unknown method" name "invoked with arguments:" args~tostring('l', ',
