   declare text character (50) initial (' ');

   put string(text) edit (25) (b);
   put skip list (trim(text, '0'));

   put string(text) edit (2147483647) (b);
   put skip list (trim(text, '0'));
