firstAndLast3Equal: procedure options(main);
    declare dict file;
    open file(dict) title('unixdict.txt');
    on endfile(dict) stop;

    declare word char(32) varying, (first3, last3) char(3);
    do while('1'b);
        get file(dict) list(word);
        first3 = substr(word, 1, 3);
        last3 = substr(word, length(word)-2, 3);
        if length(word) > 5 & first3 = last3 then
            put skip list(word);
    end;
end firstAndLast3Equal;
