 yn: Proc Options(main):
 Dcl sysin stream input;
 Dcl sysprint stream output;
 Dcl c Char(1);
 Put Skip List('Please enter Y or N');
 Get Edit(c)(a(1));
 Select(c);
   When('Y','y','J','j')
     Put Skip List('YES');
   When('N','n')
     Put Skip List('NO');
   Otherwise
     Put Skip List('Undecided?');
   End;
 End;
