/*REXX program to show a     DO  WHILE     construct. */
j=1024
         do while j>0
         say j
         j=j%2                /*in REXX, %  is integer division. */
         end
