declare s character (100) varying;
declare k fixed decimal (15);

put ('please type a string:');
get edit (s) (L);
put skip list (s);

put skip list ('please type the integer 75000');
get list (k);
put skip list (k);
put skip list ('Thanks');
