> T := table( [ (2,3) = 4, "foo" = 1, sin(x) = cos(x) ] );
          T := table(["foo" = 1, sin(x) = cos(x), (2, 3) = 4])

> T[2,3];
                                   4

> T[sin(x)];
                                 cos(x)

> T["foo"];
                                   1
