digital: procedure options (main);  /* 29 April 2014 */
   declare 1 pict union,
             2 x picture '9999999999999',
             2 d(13) picture '9';
   declare ap fixed, n fixed (15);

   do n = 5, 627615, 39390, 588225, 393900588225, 99999999999;
      x = n;
      do ap = 1 by 1 until (x < 10);
         x = sum(d);
      end;
      put skip data (n, x, ap);
   end;

end digital;
