  do j=1  while pr.j\==''
  say  'prime'   j   "is"   pr.j
  end   /*j*/
                                  /*at this point,  J=16  (because of the   DO     */
                                  /*loop incrementing the index.                   */
j= j-1                            /*J  now has the count of primes stored.         */
