  do j=1  while pr.j\==0
  say  'prime'  j  'is' pr.j
  end   /*j*/
                       /*at this point, J=15. */
j=j-1                  /*J now has the count of primes stored.*/
