declare i picture '9999';
do i = 2008 to 2121;
   if weekday(days('25Dec' || i, 'DDMmmYYYY')) = 1 then
      put skip list ('Christmas day ' || i || ' is a Sunday');
end;
