       IDENTIFICATION DIVISION.
       PROGRAM-ID. NO-0-9-IN-HEX.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 HIGH-NYBBLE      PIC 99.
       01 LOW-NYBBLE       PIC 99.
       01 OUT-NUM          PIC 999.
       01 OUT-FMT          PIC ZZ9.

       PROCEDURE DIVISION.
       BEGIN.
           MOVE ZERO TO HIGH-NYBBLE, PERFORM LOOP-LOW-NYBBLE.
           PERFORM LOOP-LOW-NYBBLE VARYING HIGH-NYBBLE FROM 10 BY 1
               UNTIL HIGH-NYBBLE IS EQUAL TO 16.
           STOP RUN.

       LOOP-LOW-NYBBLE.
           PERFORM SHOW-DECIMAL VARYING LOW-NYBBLE FROM 10 BY 1
               UNTIL LOW-NYBBLE IS EQUAL TO 16.

       SHOW-DECIMAL.
           MULTIPLY HIGH-NYBBLE BY 16 GIVING OUT-NUM.
           ADD LOW-NYBBLE TO OUT-NUM.
           MOVE OUT-NUM TO OUT-FMT.
           DISPLAY OUT-FMT.
