> (set a '"data")
"data"
> a
"data"
> (set b a)
"data"
> b
"data"
