/*REXX program (using the R4 REXX interpreter) which uses a Greek delta char).*/
'chcp'  1253  "> NUL"                  /*ensure we're using correct code page.*/
Δ=1                                    /*define delta (variable name  Δ)  to 1*/
Δ=Δ+1                                  /*bump the delta REXX variable by unity*/
say 'Δ=' Δ                             /*stick a fork in it,  we're all done. */
