> a, b := 2, "foo":
> a;
                                   2

> b;
                                 "foo"

> a, b := b, a: # SWAP
> a;
                                 "foo"

> b;
                                   2
