declare s1 entry;
declare s2 entry (fixed);
declare s3 entry (fixed, float);

declare f1 entry returns (fixed);
declare f2 entry (float) returns (float);
declare f3 entry (character(*), character(*)) returns (character (20));
