/*REXX program to switch video display modes based on columns and lines.*/

parse arg cols lines .
'MODE'   "CON:       COLS="cols     'LINES='lines
                                       /*stick a fork in it, we're done.*/
