cpt: Proc Options(main);
 Dcl x Dec Fixed(4,2);
 Do x=0 To 1 By 0.01;
   Put Edit(x,' -> ',cp(x))(Skip,f(4,2),a,f(4,2));
   End;
 cp: Proc(p) Returns(Dec Fixed(4,2));
 Dcl r(20) Dec Fixed(4,2) static init(
   .10, .18, .26, .32, .38, .44, .50, .54, .58, .62,
   .66, .70, .74, .78, .82, .86, .90, .94, .98, 1);
 Dcl p Dec Fixed(4,2);
 Dcl i Bin Fixed;
 i=trunc((100*p-1)/5)+1;
 Return(r(i));
 End;
 End;
