gen: procedure options (main);  /* 7 April 2014. */
   declare 1 ascii union,
             2 letters (26) character (1),
             2 iletters(26) unsigned fixed binary (8),
           letter character(1);
   declare i fixed binary;

   letters(1), letter = lowercase('A');

   do i = 2 to 26;
      iletters(i) = iletters(i-1) + 1;
   end;
   put edit (letters) (a);

end gen;
