 (SubscriptRange): begin;
    declare (t(100),i) fixed binary;
    i=101;
    on SubscriptRange begin; put skip list('error on t(i)'); goto e; end;
    t(i)=0;
    e:on SubscriptRange system; /* default dehaviour */
 end;
