/* Factorials using the pre-processor. */
test: procedure options (main);
   declare (x, y) fixed decimal;
   x =       24;
   put ('factorial 4  is ', x);
   y =      720;
   put skip list ('factorial 6 is ', y);
end test;
