test: proc options (main);
   declare n fixed (15);

   do n = 1 to 1000000;
      if perfect_square (n + fixed(sqrt(n) + 0.5, 15)) then
         do; put skip list ('formula fails for n = ', n); stop; end;
   end;

perfect_square: procedure (N) returns (bit (1) aligned);
   declare N fixed (15);
   declare K fixed (15);

   k = sqrt(N)+0.1;
   return ( k*k = N );
end perfect_square;

end test;
