days = 'zuntik montik dinstik mitvokh donershtik fraytik shabes'

  do j=1  for words(days)              /*loop through days of the week. */
  say word(days,j)                     /*display the weekday to screen. */
  end   /*j*/
                                       /*stick a fork in it, we're done.*/
