factors: procedure options(main);
   declare i binary( 15 )fixed;
   declare n binary( 15 )fixed;
    do n = 90 to 100;
       put skip list( 'factors of: ', n, ': ' );
       do i = 1 to n;
         if mod(n, i) = 0 then put edit( i )(f(4));
       end;
    end;
end factors;
