%Swap:Procedure(a,b);
   declare (a,b) character; /*These are proper strings of arbitrary length, pre-processor only.*/
   return ('Begin; declare t like '|| a ||'; t='|| a ||';'|| a ||'='|| b ||';'|| b ||'=t; End;');
%End Swap;
