%swap: procedure (a, b);
   declare (a, b) character;
   return ( 't=' || a || ';' || a || '=' || b || ';' || b '=t;' );
%end swap;
%activate swap;

The statement:-
   swap (p, q);

is replaced, at compile time, by the three statements:
   t = p; p = q; q = t;
