get (n);
begin;
   declare (A(n), B(n)) float;
   declare dot_product float;

   get list (A);
   get list (B);
   dot_product = sum(a*b);
   put (dot_product);
end;
