char_codes: procedure options (main);
  dcl ch char(1);
  dcl n fixed bin;
  ch = 'a';
  n = 97;
  put skip edit (ch,' = ',rank(ch)) (a, a, f(2));
  put skip edit (n,' = ',ascii(n)) (f(2), a, a);
end char_codes;
