cubeSum: procedure options(main);
    declare (i, csum) fixed decimal(7);
    csum = 0;
    do i=0 to 49;
        csum = csum + i * i * i;
        put list(csum);
        if mod(i,5) = 4 then put skip;
    end;
end cubeSum;
