       01 ws-input-record.
          05 field-a    pic x(5).
          05 field-b    pic x(5).
          05 field-c    pic s9(5).
          05 field-d    pic x(5).
