declare (start_time, finish_time) float (18);

start_time = secs();

do i = 1 to 10000000;
   /* something to be repeated goes here. */
end;
finish_time = secs();

put skip edit ('elapsed time=', finish_time - start_time, ' seconds')
   (A, F(10,3), A);
   /* gives the result to thousandths of a second. */

/* Note: using the SECS function takes into account the clock */
/* going past midnight. */
