*process or(!) source xref attributes macro options;
 /*********************************************************************
 * Program to show that PL/I is case-insensitive
 * 28.05.2013 Walter Pachl
 *********************************************************************/
 case: proc options(main);
 Dcl dog Char(20) Var;
 dog = "Benjamin";
 Dog = "Samba";
 DOG = "Bernie";
 Put Edit(dog,Dog,DOG)(Skip,3(a,x(1)));
 End;
