is_numeric: procedure (text) returns (bit (1));
   declare text character (*);
   declare x float;

   on conversion go to done;

   get string(text) edit (x) (E(length(text),0));
   return ('1'b);

done:
   return ('0'b);
end is_numeric;
