declare (a, b) fixed binary;

get list (a, b);
if a = b then
   put skip list ('The numbers are equal');
if a > b then
   put skip list ('The first number is greater than the second');
if a < b then
   put skip list ('The second number is greater than the first');
