binomial_coefficients:
   procedure options (main);
      declare (n, k) fixed;

   get (n, k);
   put (coefficient(n, k));

coefficient: procedure (n, k) returns (fixed decimal (15));
   declare (n, k) fixed;
   return (fact(n)/ (fact(n-k) * fact(k)) );
end coefficient;

fact: procedure (n) returns (fixed decimal (15));
   declare n fixed;
   declare i fixed, f fixed decimal (15);
   f = 1;
   do i = 1 to n;
      f = f * i;
   end;
   return (f);
end fact;
end binomial_coefficients;
