   define structure 1 h,
                      2 a (10) float;
   declare i fixed binary;

sub: procedure (a, b) returns (type(h));
   declare (a, b) float;
   declare p type (h);
   do i = 1 to 10;
      p.a(i) = i;
   end;
   return (p);
end sub;
