/*REXX program demonstrates displaying an extended character (glyph) to the terminal.   */
                            /* [↓]  this will display the £ glphy (if term supports it).*/
say '£'                     /*assuming the pound sign glyph is displayable on the term. */
                            /* [↑]  this can execute on an  EBCDIC  or  ASCII  machine. */
                                                 /*stick a fork in it,  we're all done. */
