/*REXX program to demonstrate displaying an extended character.         */

say d2c(163)    /*assuming the pound sign is 163 on the display codepage*/
