/*REXX program demonstrates  displaying an extended character  (glyph)  to the terminal.*/
                   /* [↓]  this  SAY will display the £ glyph (if the term supports it).*/
say '£'            /*this assumes the pound sign glyph is displayable on the terminal.  */
                   /*this program can execute correctly on an  EBCDIC or ASCII  machine.*/
                                                 /*stick a fork in it,  we're all done. */
