       >>SOURCE FORMAT IS FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. JohnsonsAlgo.

ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 CONSTANTS.
  05 INF   PIC S9(9)V9(2) COMP-3 VALUE 9999999.00.

01 GRAPH-DATA.
  05 VCOUNT PIC 9(4) COMP VALUE 4.
  05 G-MAT OCCURS 10 TIMES.
    10 G-ROW OCCURS 10 TIMES.
      15 MW PIC S9(9)V9(2) COMP-3.

01 EDGE-LIST-DATA.
  05 ECOUNT PIC 9(4) COMP VALUE 0.
  05 EDGES OCCURS 100 TIMES.
    10 EU PIC 9(4) COMP.
    10 EV PIC 9(4) COMP.
    10 EW PIC S9(9)V9(2) COMP-3.

01 AUG-DATA.
  05 AUG-V PIC 9(4) COMP.
  05 AUG-ECOUNT PIC 9(4) COMP.
  05 AUG-EDGES OCCURS 110 TIMES.
    10 AU PIC 9(4) COMP.
    10 AV PIC 9(4) COMP.
    10 AW PIC S9(9)V9(2) COMP-3.

01 BF-DATA.
  05 H-VALS OCCURS 11 TIMES PIC S9(9)V9(2) COMP-3.
  05 BF-UPD PIC X.
    88 IS-UPD VALUE 'Y'.
    88 NOT-UPD VALUE 'N'.
  05 NEG-CYC PIC X VALUE 'N'.

01 RW-ADJ.
  05 RW-ECOUNTS OCCURS 10 TIMES PIC 9(4) COMP.
  05 RW-EDGES OCCURS 10 TIMES.
    10 RW-EDGE OCCURS 10 TIMES.
      15 RW-V PIC 9(4) COMP.
      15 RW-W PIC S9(9)V9(2) COMP-3.

01 DIJKSTRA-DATA.
  05 DDIST OCCURS 10 TIMES PIC S9(9)V9(2) COMP-3.
  05 FDIST OCCURS 10 TIMES PIC S9(9)V9(2) COMP-3.
  05 D-VIS OCCURS 10 TIMES PIC X.
    88 IS-VIS VALUE 'Y'.
    88 NOT-VIS VALUE 'N'.

01 ALL-PAIRS-SP.
  05 SP-ROW OCCURS 10 TIMES.
    10 SP-VAL OCCURS 10 TIMES PIC S9(9)V9(2) COMP-3.

01 TEMP-VARS.
  05 TWEIGHT PIC S9(9)V9(2) COMP-3.
  05 TVAL PIC S9(9)V9(2) COMP-3.
  05 MDIST PIC S9(9)V9(2) COMP-3.
  05 MU PIC 9(4) COMP.
  05 I PIC 9(4) COMP.
  05 J PIC 9(4) COMP.
  05 S PIC 9(4) COMP.
  05 IDX PIC 9(4) COMP.
  05 ITER PIC 9(4) COMP.

01 PRINT-DATA.
  05 OUT-STR PIC X(100).
  05 OUT-POS PIC 9(3) COMP.
  05 NUM-STR PIC ----9.9.
  05 T-STR   PIC X(20).

PROCEDURE DIVISION.
TEST-MAIN.
    PERFORM INIT-G
    PERFORM STEP1-AUG
    PERFORM BF-ALGO

    IF NEG-CYC = 'Y'
      DISPLAY "A negative cycle was detected in the graph."
    ELSE
      PERFORM RW-EDGES-PROC
      PERFORM RUN-DIJK

      DISPLAY "All pairs shortest paths:"
      DISPLAY "The element (i, j) is the shortest path between vertex i and vertex j."
      PERFORM PRINT-RES
    END-IF
    STOP RUN.

INIT-G.
    MOVE 4 TO VCOUNT.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > VCOUNT
      PERFORM VARYING J FROM 1 BY 1 UNTIL J > VCOUNT
        MOVE INF TO MW (I, J)
      END-PERFORM
    END-PERFORM.

    MOVE  0.0 TO MW (1, 1).
    MOVE -5.0 TO MW (1, 2).
    MOVE  2.0 TO MW (1, 3).
    MOVE  3.0 TO MW (1, 4).

    MOVE  0.0 TO MW (2, 2).
    MOVE  4.0 TO MW (2, 3).

    MOVE  0.0 TO MW (3, 3).
    MOVE  1.0 TO MW (3, 4).

    MOVE  0.0 TO MW (4, 4).

    MOVE 0 TO ECOUNT.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > VCOUNT
      PERFORM VARYING J FROM 1 BY 1 UNTIL J > VCOUNT
        MOVE MW (I, J) TO TWEIGHT
        IF I = J
          IF TWEIGHT NOT = 0.0
            DISPLAY "Warning: graph[i][i] expected 0"
          END-IF
        ELSE
          IF TWEIGHT < 9999990.00
            ADD 1 TO ECOUNT
            MOVE I TO EU (ECOUNT)
            MOVE J TO EV (ECOUNT)
            MOVE TWEIGHT TO EW (ECOUNT)
          END-IF
        END-IF
      END-PERFORM
    END-PERFORM.

STEP1-AUG.
    COMPUTE AUG-V = VCOUNT + 1
    MOVE ECOUNT TO AUG-ECOUNT

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > ECOUNT
      MOVE EU (I) TO AU (I)
      MOVE EV (I) TO AV (I)
      MOVE EW (I) TO AW (I)
    END-PERFORM

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > VCOUNT
      ADD 1 TO AUG-ECOUNT
      MOVE AUG-V TO AU (AUG-ECOUNT)
      MOVE I     TO AV (AUG-ECOUNT)
      MOVE 0.0   TO AW (AUG-ECOUNT)
    END-PERFORM.

BF-ALGO.
    MOVE 'N' TO NEG-CYC

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > AUG-V
      MOVE INF TO H-VALS (I)
    END-PERFORM
    MOVE 0 TO H-VALS (AUG-V)

    PERFORM VARYING ITER FROM 1 BY 1 UNTIL ITER >= AUG-V
      SET NOT-UPD TO TRUE
      PERFORM VARYING J FROM 1 BY 1 UNTIL J > AUG-ECOUNT
        IF H-VALS (AU (J)) < 9999990.00
          COMPUTE TVAL = H-VALS (AU (J)) + AW (J)
          IF TVAL < H-VALS (AV (J))
            MOVE TVAL TO H-VALS (AV (J))
            SET IS-UPD TO TRUE
          END-IF
        END-IF
      END-PERFORM
      IF NOT-UPD
        EXIT PERFORM
      END-IF
    END-PERFORM

    PERFORM VARYING J FROM 1 BY 1 UNTIL J > AUG-ECOUNT
      IF H-VALS (AU (J)) < 9999990.00
        COMPUTE TVAL = H-VALS (AU (J)) + AW (J)
        IF TVAL < H-VALS (AV (J))
          MOVE 'Y' TO NEG-CYC
        END-IF
      END-IF
    END-PERFORM.

RW-EDGES-PROC.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > VCOUNT
      MOVE 0 TO RW-ECOUNTS (I)
    END-PERFORM

    PERFORM VARYING J FROM 1 BY 1 UNTIL J > ECOUNT
      IF H-VALS (EU (J)) > 9999990.00 OR
         H-VALS (EV (J)) > 9999990.00
        DISPLAY "Warning: invalid hValues detected"
      END-IF

      ADD 1 TO RW-ECOUNTS (EU (J))
      MOVE RW-ECOUNTS (EU (J)) TO IDX

      MOVE EV (J) TO RW-V (EU (J), IDX)
      COMPUTE RW-W (EU (J), IDX) = EW (J)
                                 + H-VALS (EU (J))
                                 - H-VALS (EV (J))
    END-PERFORM.

RUN-DIJK.
    PERFORM VARYING S FROM 1 BY 1 UNTIL S > VCOUNT
      PERFORM DIJK-FOR-V
      PERFORM VARYING I FROM 1 BY 1 UNTIL I > VCOUNT
        MOVE FDIST (I) TO SP-VAL (S, I)
      END-PERFORM
    END-PERFORM.

DIJK-FOR-V.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > VCOUNT
      MOVE INF TO DDIST (I)
      MOVE INF TO FDIST (I)
      SET NOT-VIS (I) TO TRUE
    END-PERFORM
    MOVE 0 TO DDIST (S)

    PERFORM VCOUNT TIMES
      MOVE INF TO MDIST
      MOVE 0 TO MU
      PERFORM VARYING I FROM 1 BY 1 UNTIL I > VCOUNT
        IF NOT IS-VIS (I) AND DDIST (I) < MDIST
          MOVE DDIST (I) TO MDIST
          MOVE I TO MU
        END-IF
      END-PERFORM

      IF MU = 0
        EXIT PERFORM
      END-IF

      SET IS-VIS (MU) TO TRUE

      IF FDIST (MU) > 9999990.00
        IF DDIST (MU) > 9999990.00
          MOVE INF TO FDIST (MU)
        ELSE
          COMPUTE FDIST (MU) = DDIST (MU) - H-VALS (S) + H-VALS (MU)
        END-IF
      END-IF

      PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > RW-ECOUNTS (MU)
        MOVE RW-V (MU, IDX) TO J
        IF DDIST (MU) < 9999990.00
          COMPUTE TVAL = DDIST (MU) + RW-W (MU, IDX)
          IF TVAL < DDIST (J)
            MOVE TVAL TO DDIST (J)
          END-IF
        END-IF
      END-PERFORM
    END-PERFORM

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > VCOUNT
      IF FDIST (I) > 9999990.00 AND DDIST (I) < 9999990.00
        COMPUTE FDIST (I) = DDIST (I) - H-VALS (S) + H-VALS (I)
      END-IF
    END-PERFORM.

PRINT-RES.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > VCOUNT
      MOVE SPACES TO OUT-STR
      MOVE "[" TO OUT-STR
      MOVE 2 TO OUT-POS
      PERFORM VARYING J FROM 1 BY 1 UNTIL J > VCOUNT
        IF SP-VAL (I, J) > 9999990.00
          STRING "INF " DELIMITED BY SIZE
                 INTO OUT-STR WITH POINTER OUT-POS
        ELSE
          MOVE SP-VAL (I, J) TO NUM-STR
          MOVE FUNCTION TRIM(NUM-STR) TO T-STR
          STRING FUNCTION TRIM(T-STR) DELIMITED BY SIZE
                 " " DELIMITED BY SIZE
                 INTO OUT-STR WITH POINTER OUT-POS
        END-IF
      END-PERFORM
      STRING "]" DELIMITED BY SIZE
             INTO OUT-STR WITH POINTER OUT-POS
      DISPLAY FUNCTION TRIM(OUT-STR)
    END-PERFORM.

