the: procedure options(main);
    declare dict file;
    open file(dict) title('unixdict.txt');
    on endfile(dict) stop;

    declare word char(32) varying;
    do while('1'b);
        get file(dict) list(word);
        if length(word) > 11 & index(word,'the') ^= 0 then
            put skip list(word);
    end;

    close file(dict);
end the;
