infinity: procedure options (main);
   declare k fixed decimal (30);
   put skip edit
      ((k do k = 1 to 999999999999999999999999999998))(f(31));
end infinity;
