 p: Proc Options(main);
 Dcl a(2) Char(6) Varying Init('apple','orange');
 Put Edit('Array a has',(hbound(a)-lbound(a)+1),' elements.')
         (Skip,a,f(2),a);
 Put Skip Data(a);
 End;
