print_all:  procedure              /*   [↓]     is the # of args passed.*/
                           do j=1  for arg()
                           say  arg(j)
                           end   /*j*/
return
