print_all:  procedure
                           do j=1  for arg()
                           say '[argument' j"]: " arg(j)
                           end   /*j*/
return
