print_all:  procedure
                           do j=1  for arg()
                           say arg(j)
                           end   /*j*/
return
