details: procedure options (main); /* 6 July 2012 */
	declare x float, i fixed binary initial (1);

	put skip list ('word size=', length(unspec(x)));

	if unspec(i) = '0000000000000001'b then
		put skip list ('Big endian');
	else
		put skip list ('Little endian');
	
end details;
