>>IF docpass NOT DEFINED

... code ...

>>ELSE
!doc-marker!
========
:SAMPLE:
========

.. contents::

Introduction
------------
ReStructuredText or other markup source ...
>>END-IF
