declare X(5) float (9)  initial (1, 2, 3, 4, 5),
        Y(5) float (18) initial (9, 8, 7, 6, 1e9);
declare (x_precision, y_precision) fixed binary;
open file (out) title ('/OUT.TXT,type(text),recsize(100)');
x_precision = 9;
y_precision = 16;
put file (out) edit ((X(i), Y(i) do i = 1 to 5))
                     (skip, e(16, x_precision),
                      x(2), e(20, y_precision) );
