read: procedure options (main);
   declare line character (500) varying;

   on endfile (sysin) stop;

   do forever;
      get edit (line)(L);
   end;
end read;
