...
/* call Primes 105e3 */
/* call First20 */
/* call Between100and150 */
/* call Between7700and8000 */
/* call Number10000 */
call Primes 1e8
call Extended
...
