f: procedure (g) returns (float);
   declare g entry (float);

   get (x);
   put (g(x));
end f;

   x = f(p); /* where "p" is the name of a function. */
