declare 1 table (100),
          2 name character (20) varying,
          2 address,
            3 number fixed decimal,
            3 street character (30) varying,
            3 suburb character (30) varying,
            3 zip picture '9999',
          2 transaction_date date,
          2 sex character (1),
          2 suppress_junk_mail bit (1);
