/* REXX ***************************************************************
* 18.10.2012 Walter Pachl Not only the list of elements shortened:-)
**********************************************************************/
wl='hydrogen helium lithium beryllium boron carbon nitrogen oxygen',
   'fluorine neon sodium magnesium aluminum silicon phosphorous sulfur',
   '...',
   'meitnerium darmstadtium roentgenium copernicium Ununtrium'

Say word(wl,random(1,words(wl)))
