/* First part: */

declare L (10000) fixed static initial ((1000) 0);
L(1), L(2) = 1;
do i = 3 to 10000;
   k = L(i);
   L(i) = L(i-k) + L(1+k);
end;
