       IDENTIFICATION DIVISION.
       PROGRAM-ID. ring-terminal-bell.

       DATA DIVISION.
       SCREEN SECTION.
       01  ringer BELL.

       PROCEDURE DIVISION.
           DISPLAY ringer.
           STOP RUN.

       END PROGRAM ring-terminal-bell.
