/* PL/I permits optional arguments, but not an infinitely varying */
/* argument list: */
s: procedure (a, b, c, d);
   declare (a, b, c, d, e) float optional;
   if ^omitted(a) then put skip list (a);
   if ^omitted(b) then put skip list (b);
   if ^omitted(c) then put skip list (c);
   if ^omitted(d) then put skip list (d);
end s;
