> Quibble([]);
                                  "{}"

> Quibble( [ "ABC" ] );
                                "{ABC}"

> Quibble( [ "ABC", "DEF" ] );
                            "{ABC and DEF}"

> Quibble( ["ABC", "DEF", "G", "H"] );
                         "{ABC, DEF, G and H}"
