   declare (c1, c2) float complex,
           (a, b, c, x1, x2) float;

   get list (a, b, c);
   if b**2 < 4*a*c then
      do;
         c1 = (-b + sqrt(b**2 - 4+0i*a*c)) / (2*a);
         c2 = (-b - sqrt(b**2 - 4+0i*a*c)) / (2*a);
         put data (c1, c2);
      end;
   else
      do;
         x1 = (-b + sqrt(b**2 - 4*a*c)) / (2*a);
         x2 = (-b - sqrt(b**2 - 4*a*c)) / (2*a);
         put data (x1, x2);
      end;
