declare A(200) float;
declare ap fixed binary;
declare i fixed binary;

ap = 0;
do i = 1 to 10;
   ap = ap + 1;
   get list ( A(ap) );
   put skip list ( std_dev (a, ap) );
end;

std_dev: procedure (A, ap) returns (float);
   declare A(*) float, ap fixed binary nonassignable;
   declare i fixed binary;
   declare B(ap) float, average float;

   do i = 1 to ap;
      B(i) = A(i);
   end;
   average = sum(A) /ap;

   return ( sqrt (sum(B**2)/ap - average**2) );
end std_dev;
