       01  X PIC 9.
           88 X-Is-One        VALUE 1.
           88 X-Is-Even       VALUE 0 2 4 6 8.
           88 X-Larger-Than-5 VALUE 6 THRU 9.
