test: proc options (main);
   declare n fixed;

denom: procedure (n) recursive returns (float (18));
   declare n fixed;
   n = n + 1;
   if n > 100 then return (n);
   return (n + n/denom(n));
end denom;

   put (2 + 1/denom(0));

end test;
