/* Version for SQRT(2) */
test: proc options (main);
   declare n fixed;

denom: procedure (n) recursive returns (float (18));
   declare n fixed;
   n = n + 1;
   if n > 100 then return (2);
   return (2 + 1/denom(n));
end denom;

   put (1 + 1/denom(2));

end test;
