declare N fixed binary;
get edit (N) (A(7)); /* decimal input of 7 columns */
put skip list (N);

declare BS bit (32);
get edit (BS) (B(32)); /* Binary input of 32 binary digits. */
put skip edit (BS) (B);
