largestProperDivisor: procedure options(main);
    lpd: procedure(n) returns(fixed);
        declare (n, i) fixed;
        if n <= 1 then return(1);
        do i=n-1 repeat(i-1) while(i>=1);
            if mod(n,i)=0 then return(i);
        end;
    end lpd;

    declare i fixed;
    do i=1 to 100;
        put edit(lpd(i)) (F(3));
        if mod(i,10)=0 then put skip;
    end;
end largestProperDivisor;
