> acc := AccumulatorFactory( 1 ):
> acc( 5 );
                                     6

> AccumulatorFactory( 3 ):
> acc( 2.3 );
                                     8.3

> acc(); # use the default increment of 1
                                     9.3

> acc( 3 - 4 * I ); # also handles complex numbers
                                     12.3 - 4. I

> acc( I ); # add the imaginary unit
                                     12.3 - 3. I
