radius=6.28                            /*assign a value to a variable.  */
                say 'radius =' radius
drop radius                            /*now, "undefine" the variable.  */
                say 'radius =' radius
