call value 'CAT', "When the cat's away, the mice will play."
                                       /*assigns a literal ───►  CAT    */
yyy='CA'
call value yyy'T', "Honest as the Cat when the meat's out of reach."
                                       /*assigns a literal ───►  CAT    */
yyy = 'CA'
call value yyy || 'T', "Honest as the Cat when the meat's out of reach."
                                       /*assigns a literal ───►  CAT    */
