       IDENTIFICATION DIVISION.
       PROGRAM-ID. Spam.

       PROCEDURE DIVISION.
           PERFORM FOREVER
               DISPLAY "SPAM"
           END-PERFORM

           GOBACK
           .
