   declare x(20,20) fixed;  /* 16 August 2010. */
   x = random()*20 + 1;
loops:
   do i = 1 to hbound(x,1);
      do j = 1 to hbound(x,2);
         put (x(i,j));
         if x(i,j) = 20 then leave loops;
      end;
      if x(i,j) = 20 then leave;
   end;
