   declare (S1, S2) character (20) varying; /* 11 Aug 2022 */
   get (S1, S2);
   if length(S1) > length(S2) then
      put (length(S1), S1);
   else
      put (length(S2), S2);
