(%i6) magic(3);
                                  [ 8  1  6 ]
                                  [         ]
(%o6)                             [ 3  5  7 ]
                                  [         ]
                                  [ 4  9  2 ]
(%i7) magic(5);
                            [ 17  24  1   8   15 ]
                            [                    ]
                            [ 23  5   7   14  16 ]
                            [                    ]
(%o7)                       [ 4   6   13  20  22 ]
                            [                    ]
                            [ 10  12  19  21  3  ]
                            [                    ]
                            [ 11  18  25  2   9  ]
(%i8) magic(7);
                        [ 30  39  48  1   10  19  28 ]
                        [                            ]
                        [ 38  47  7   9   18  27  29 ]
                        [                            ]
                        [ 46  6   8   17  26  35  37 ]
                        [                            ]
(%o8)                   [ 5   14  16  25  34  36  45 ]
                        [                            ]
                        [ 13  15  24  33  42  44  4  ]
                        [                            ]
                        [ 21  23  32  41  43  3   12 ]
                        [                            ]
                        [ 22  31  40  49  2   11  20 ]
/* magic number for n=7 */
(%i9) lsum(q, q, first(magic(7)));
(%o9)                                 175
