munch: procedure options (main); /* 21 May 2014 */

   declare screen (0:255, 0:255) bit(24) aligned;
   declare b bit(8) aligned;
   declare (x, y) unsigned fixed binary (8);

   do x = 0 upthru hbound(screen,2);
      do y = 0 upthru hbound(screen,1);
         b = unspec(x) ^ unspec(y);
         screen(x,y) = b;
      end;
   end;
   call writeppm(screen);
end munch;
