/*REXX program lists contents of current folder  (ala mode UNIX's  LS). */
'DIR  /b  /oN'                         /*use Windows DIR: sorts & lists.*/
                                       /*stick a fork in it, we're done.*/
