/*REXX pgm finds symmetric difference and symm. AND (between two lists).*/
a.=0                                              /*falsify the booleans*/
a= '["Zahn", "Yi", "Stands with a Fist", "", "Hungry Wolf", "Yi"]'
b= '["Draag Ng [Jr.]", "Patzy", "Zahn", "Yi", "Robert the Bruce"]'
 ∙
 ∙
 ∙
