df: proc Options(main);
 declare day_of_week(7) character (9) varying initial(
    'Sunday','Monday','Tuesday','Wednesday',
    'Thursday','Friday','Saturday');
 declare today character (9);

 today = datetime('YYYYMMDD');
 put edit(substr(today,1,4),'-',substr(today,5,2),'-',substr(today,7))
  (A);

 today = datetime('MmmDDYYYY');
 put skip edit(day_of_week(weekday(days())),', ') (A);
 put edit(substr(today,1,3),' ',substr(today,4,2),', ',
          substr(today,6,4))(A);
 end;
