mcnugget: procedure options(main);
    declare nugget(0:100) bit, (a, b, c) fixed;
    do a=0 to 100; nugget(a) = '0'b; end;

    do a=0 to 100 by 6;
        do b=a to 100 by 9;
            do c=b to 100 by 20;
                nugget(c) = '1'b;
            end;
        end;
    end;

    do a=100 to 0 by -1;
        if ^nugget(a) then do;
            put skip list('Maximum non-McNuggets number:', a);
            stop;
        end;
    end;
end mcnugget;
