*process source attributes xref macro or(!);
 tf: proc options(main);
 %Dcl true char; %true='''1''b';
 %Dcl false char; %false='''0''b';
 If true Then
   Put Skip list('That''s true');
 If false Then
   Put Skip List('ERROR');
 Else
   Put Skip List('false was recognized');
 End;
