declare line character (200) varying;

open file (in) title ('/TEXT.DAT,type(text),recsize(200)' );
on endfile (in) stop;

do forever;
   get edit (line) (L);
   put skip list (line);
end;
