count: procedure options (main); /* 12 Jan. 2014 */
   declare (i, j) fixed binary;

   do i = 0 upthru 2147483647;
      do j = 30 to 0 by -3;
         put edit (iand(isrl(i, j), 7) ) (f(1));
      end;
      put skip;
   end;

end count;
