 mainproc: proc options(main) reorder;

 subproc: proc;
 dcl subvar char init ('X');

 put skip data(subvar);
 subvar = 'Q';
 end subproc;

 call subproc();
 call subproc();
 end mainproc;
