 mainproc: proc options(main) reorder;
 dcl ctlvar char ctl;

 alloc ctlvar;
 ctlvar = 'A';
 alloc ctlvar;
 ctlvar = 'B';
 alloc ctlvar;
 ctlvar = 'C';

 put skip data(ctlvar);
 free ctlvar;
 put skip data(ctlvar);
 free ctlvar;
 put skip data(ctlvar);
 free ctlvar;
 end mainproc;
