declare (matrix(3,3), vector(3), scalar) fixed;
declare (m(3,3), v(3) fixed;

m = scalar * matrix;
m = vector * matrix;
m = matrix * matrix;

v = scalar * vector;
v = vector * vector;
