octal_count:
    procedure options (main);
    dcl i fixed;
    i = 1;
    do while (i ^=  0);
       put skip list (octal(i));
       i = i + 1;
    end;

    stop;

octal:
    procedure (n) returns (char(6) varying);
    dcl
       (n, m) fixed,
       s char(6) varying;
    /* n is passed by reference, so make a local copy */
    m = n;
    s = '';
    do while (m > 0);
       s = ascii(mod(m,8) + rank('0')) || s;
       m = m / 8;
    end;
    return (s);
end octal;

end octal_count;
