octal_count:
    procedure options (main);
    dcl i fixed;
    i = 1;
    do while (i ^= 0);
      put skip edit (unspec(i)) (b3);
      i = i + 1;
    end;

end octal_count;
