> map( sqrt, [ 1.1, 3.2, 5.7 ] );
                [1.048808848, 1.788854382, 2.387467277]

> map( x -> x + 1, { 1, 3, 5 } );
                               {2, 4, 6}

> sqrt~( [ 1.1, 3.2, 5.7 ] );
                [1.048808848, 1.788854382, 2.387467277]

> (x -> x + 1)~( { 1, 3, 5 } );
                               {2, 4, 6}
