        IDENTIFICATION DIVISION.
        PROGRAM-ID. program.

        AUTHOR. Rest of line ignored.
        REMARKS. Rest of line ignored.
        REMARKS. More remarks.
        SECURITY. line ignored.
        INSTALLATION. line ignored.
        DATE-WRITTEN. same, human readable dates are allowed for instance
        DATE-COMPILED. same.
        DATE-MODIFIED. this one is handy when auto-stamped by an editor.
