logical_ops: procedure (t, u);
   declare (t, u) bit (1);

   put skip list (t & u);
   put skip list (t | u); /* logical or   */
   put skip list (^t);    /* logical not  */
   put skip list (t ^ u); /* exclusive or */
end logical_ops;
