       IDENTIFICATION DIVISION.
       PROGRAM-ID. GOODBYE-WORLD.
       PROCEDURE DIVISION.
           DISPLAY 'Goodbye, World!' WITH NO ADVANCING.
           STOP RUN.
       END PROGRAM GOODBYE-WORLD.
