exponentiation: procedure options(main);
    put skip edit('5**3**2   = ', 5**3**2)   (A,F(7));
    put skip edit('(5**3)**2 = ', (5**3)**2) (A,F(7));
    put skip edit('5**(3**2) = ', 5**(3**2)) (A,F(7));
end exponentiation;
