declare (t, u)(40) fixed binary;
declare (i, n) fixed binary;

t,u = 0;
get (n);
if n <= 0 then return;

do n = 1 to n;
   u(1) = 1;
   do i = 1 to n;
      u(i+1) = t(i) + t(i+1);
   end;
   put skip edit ((u(i) do i = 1 to n)) (col(40-2*n), (n+1) f(4));
   t = u;
end;
