   datatype    NB. data type identification verb
3 : 0
n=. 1 2 4 8 16 32 64 128 1024 2048 4096 8192 16384 32768 65536 131072
t=. '/boolean/literal/integer/floating/complex/boxed/extended/rational'
t=. t,'/sparse boolean/sparse literal/sparse integer/sparse floating'
t=. t,'/sparse complex/sparse boxed/symbol/unicode'
(n i. 3!:0 y) pick <;._1 t
)


   NB. examples of the data types
   [A =: 0 1 ; 0 1 2 ; (!24x) ; 1r2 ; 1.2 ; 1j2 ; (<'boxed') ; (s:'`symbol')  ; 'literal' ; (u: 16b263a)
┌───┬─────┬────────────────────────┬───┬───┬───┬───────┬───────┬───────┬───┐
│0 1│0 1 2│620448401733239439360000│1r2│1.2│1j2│┌─────┐│`symbol│literal│☺│
│   │     │                        │   │   │   ││boxed││       │       │   │
│   │     │                        │   │   │   │└─────┘│       │       │   │
└───┴─────┴────────────────────────┴───┴───┴───┴───────┴───────┴───────┴───┘


   datatype&.>A
┌───────┬───────┬────────┬────────┬────────┬───────┬─────┬──────┬───────┬───────┐
│boolean│integer│extended│rational│floating│complex│boxed│symbol│literal│unicode│
└───────┴───────┴────────┴────────┴────────┴───────┴─────┴──────┴───────┴───────┘


   [I =: =i.4  NB. Boolean matrix
1 0 0 0
0 1 0 0
0 0 1 0
0 0 0 1

   datatype I
boolean


   $. I  NB. sparse matrix
0 0 │ 1
1 1 │ 1
2 2 │ 1
3 3 │ 1


   datatype $. I
sparse boolean

   (+ $.)I  NB. hook adds data to sparse version of data resulting in sparse
0 0 │ 2
1 1 │ 2
2 2 │ 2
3 3 │ 2
