   declare tally fixed binary (31) initial (0);

   do i = 1 to n-1;
      if Q(i) > Q(i+1) then tally = tally + 1;
   end;
   put skip data (tally);
