/* Third way using a PROCEDURE block: */

get list (m, n);
call S (m, n);
S: procedure (m, n);
   declare A(m, n) float;
   get list (A);
   put skip list (A);
end S;

/* The array is automatically destroyed when the procedure terminates. */
