/* First way using a controlled variable: */

declare A(*,*) float controlled;
get list (m, n);
allocate A(m,n);
get list (A);
put skip list (A);

/* The array remains allocated until the program terminates, */
/* or until explicitly destroyed using a FREE statement.     */

free A;
