/* Second way using a BEGIN block: */

get list (m, n);
begin;
   declare A(m, n) float;
   get list (A);
   put skip list (A);
end;

/* The array is automatically destroyed when the block terminates. */
