Proc DivideDZ(a,b) Returns(Float Bin(33));
    Dcl (a,b,c) Float Bin(33);	
    On ZeroDivide GoTo MyError;
    c=a/b;
    Return(c);
MyError:
    Put Skip List('Divide by Zero Detected!');
End DivideDZ;

xx=DivideDZ(1,0);
