Pre_Cat: procedure options (main); /* 2 November 2013 */
   declare s character (100) varying;
   s = ' bowl';
   s = 'dust' || s;
   put (s);
end Pre_Cat;
