cocktail: procedure (A);
   declare A(*) fixed;
   declare t fixed;
   declare stable bit (1);
   declare (i, n) fixed binary (31);

   n = hbound(A,1);
   do until (stable);
      stable = '1'b;
      do i = 1 to n-1, n-1 to 1 by -1;
         if A(i) > A(i+1) then
            do; stable = '0'b; /* still unsorted, so set false. */
                t = A(i); A(i) = A(i+1); A(i+1) = t;
            end;
      end;
   end;
end cocktail;
