/**********************************************************************
* 21.04.2014 Walter Pachl
**********************************************************************/
Say 'rxCalcpower(0,0)  ->' rxCalcpower(0,0)
Say '0**0              ->' 0**0
::requires rxmath library
