declare whitespace character(33) value
   ((substr(collate(), 1, 32) || ' '));
put ( trim(text, whitespace) );       /* trims leading white space.  */
put ( trim(text, '', whitespace) );   /* trims trailing white space. */
put ( trim(text, whitespace, whitespace) );
                                      /* trims leading and trailing  */
                                      /* white space.                */
