/*REXX program obtains two numbers from the input stream (the console), shows their sum.*/
parse pull a b                                   /*obtain two numbers from input stream.*/
say a+b                                          /*display the sum to the terminal.     */
                                                 /*stick a fork in it,  we're all done. */
