/*REXX pgm deletes a file */
file= 'afile.txt'                     /*name of a file  to be deleted.*/
res=sysFileDelete(file); Say file 'res='res
File= 'bfile.txt'                     /*name of a file  to be deleted.*/
res=sysFileDelete(file); Say file 'res='res
