nautical: procedure options (main);      /* 29 October 2013 */
   declare (hour, t, i) fixed binary;

   do until (substr(time(), 3, 4) = '0000'); delay (1000); end;
   hour = substr(time(), 1, 2);

   do while ('1'b);
      do i = 1 to hour;
         put edit ('07'X) (a); put skip edit ('gong ') (a); delay (500);
      end;
      t = substr(time(), 5);
      delay (60*60*1000 - t);
   end;
end nautical;
