           /*output from parse version (almost all REXX versions)  */
           /*      theREXXinterpreterName level mm Mon yyyy        */

parse version . level .
if level<4 then exit
