INSSORT: PROCEDURE (A);
   DCL  A(*)        FIXED BIN(31);
   DCL (I, J, V, N) FIXED BIN(31);

   N = HBOUND(A,1); M = LBOUND(A,1);
   DO I=M+1 TO N;
      V=A(I);
      J=I-1;
      DO WHILE (J > M-1);
         if A(J) <= V then leave;
         A(J+1)=A(J); J=J-1;
      END;
      A(J+1)=V;
   END;
   RETURN;
END INSSORT;
