insert_sort: proc(array);
  dcl array(*)      fixed bin(31);
  dcl (i,j,tmp,h,l) fixed bin(31);

  l = lbound(array, 1);
  h = hbound(array, 1);

  do i = l + 1 to h;
    tmp = array(i);

    do j = i - 1 by -1 while(j > l - 1 & array(j) > tmp);
      array(j + 1) = array(j);
    end;

    array(j + 1) = tmp;
  end;
end insert_sort;
