>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. ChristofidesAlgorithm.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY.
    FUNCTION ALL INTRINSIC.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-N                 PIC 9(4) BINARY VALUE 100.

01  POINTS-DATA.
           05 FILLER PIC 9(4) COMP-5 VALUE 1380.
           05 FILLER PIC 9(4) COMP-5 VALUE 939.
           05 FILLER PIC 9(4) COMP-5 VALUE 2848.
           05 FILLER PIC 9(4) COMP-5 VALUE 96.
           05 FILLER PIC 9(4) COMP-5 VALUE 3510.
           05 FILLER PIC 9(4) COMP-5 VALUE 1671.
           05 FILLER PIC 9(4) COMP-5 VALUE 457.
           05 FILLER PIC 9(4) COMP-5 VALUE 334.
           05 FILLER PIC 9(4) COMP-5 VALUE 3888.
           05 FILLER PIC 9(4) COMP-5 VALUE 666.
           05 FILLER PIC 9(4) COMP-5 VALUE 984.
           05 FILLER PIC 9(4) COMP-5 VALUE 965.
           05 FILLER PIC 9(4) COMP-5 VALUE 2721.
           05 FILLER PIC 9(4) COMP-5 VALUE 1482.
           05 FILLER PIC 9(4) COMP-5 VALUE 1286.
           05 FILLER PIC 9(4) COMP-5 VALUE 525.
           05 FILLER PIC 9(4) COMP-5 VALUE 2716.
           05 FILLER PIC 9(4) COMP-5 VALUE 1432.
           05 FILLER PIC 9(4) COMP-5 VALUE 738.
           05 FILLER PIC 9(4) COMP-5 VALUE 1325.
           05 FILLER PIC 9(4) COMP-5 VALUE 1251.
           05 FILLER PIC 9(4) COMP-5 VALUE 1832.
           05 FILLER PIC 9(4) COMP-5 VALUE 2728.
           05 FILLER PIC 9(4) COMP-5 VALUE 1698.
           05 FILLER PIC 9(4) COMP-5 VALUE 3815.
           05 FILLER PIC 9(4) COMP-5 VALUE 169.
           05 FILLER PIC 9(4) COMP-5 VALUE 3683.
           05 FILLER PIC 9(4) COMP-5 VALUE 1533.
           05 FILLER PIC 9(4) COMP-5 VALUE 1247.
           05 FILLER PIC 9(4) COMP-5 VALUE 1945.
           05 FILLER PIC 9(4) COMP-5 VALUE 123.
           05 FILLER PIC 9(4) COMP-5 VALUE 862.
           05 FILLER PIC 9(4) COMP-5 VALUE 1234.
           05 FILLER PIC 9(4) COMP-5 VALUE 1946.
           05 FILLER PIC 9(4) COMP-5 VALUE 252.
           05 FILLER PIC 9(4) COMP-5 VALUE 1240.
           05 FILLER PIC 9(4) COMP-5 VALUE 611.
           05 FILLER PIC 9(4) COMP-5 VALUE 673.
           05 FILLER PIC 9(4) COMP-5 VALUE 2576.
           05 FILLER PIC 9(4) COMP-5 VALUE 1676.
           05 FILLER PIC 9(4) COMP-5 VALUE 928.
           05 FILLER PIC 9(4) COMP-5 VALUE 1700.
           05 FILLER PIC 9(4) COMP-5 VALUE 53.
           05 FILLER PIC 9(4) COMP-5 VALUE 857.
           05 FILLER PIC 9(4) COMP-5 VALUE 1807.
           05 FILLER PIC 9(4) COMP-5 VALUE 1711.
           05 FILLER PIC 9(4) COMP-5 VALUE 274.
           05 FILLER PIC 9(4) COMP-5 VALUE 1420.
           05 FILLER PIC 9(4) COMP-5 VALUE 2574.
           05 FILLER PIC 9(4) COMP-5 VALUE 946.
           05 FILLER PIC 9(4) COMP-5 VALUE 178.
           05 FILLER PIC 9(4) COMP-5 VALUE 24.
           05 FILLER PIC 9(4) COMP-5 VALUE 2678.
           05 FILLER PIC 9(4) COMP-5 VALUE 1825.
           05 FILLER PIC 9(4) COMP-5 VALUE 1795.
           05 FILLER PIC 9(4) COMP-5 VALUE 962.
           05 FILLER PIC 9(4) COMP-5 VALUE 3384.
           05 FILLER PIC 9(4) COMP-5 VALUE 1498.
           05 FILLER PIC 9(4) COMP-5 VALUE 3520.
           05 FILLER PIC 9(4) COMP-5 VALUE 1079.
           05 FILLER PIC 9(4) COMP-5 VALUE 1256.
           05 FILLER PIC 9(4) COMP-5 VALUE 61.
           05 FILLER PIC 9(4) COMP-5 VALUE 1424.
           05 FILLER PIC 9(4) COMP-5 VALUE 1728.
           05 FILLER PIC 9(4) COMP-5 VALUE 3913.
           05 FILLER PIC 9(4) COMP-5 VALUE 192.
           05 FILLER PIC 9(4) COMP-5 VALUE 3085.
           05 FILLER PIC 9(4) COMP-5 VALUE 1528.
           05 FILLER PIC 9(4) COMP-5 VALUE 2573.
           05 FILLER PIC 9(4) COMP-5 VALUE 1969.
           05 FILLER PIC 9(4) COMP-5 VALUE 463.
           05 FILLER PIC 9(4) COMP-5 VALUE 1670.
           05 FILLER PIC 9(4) COMP-5 VALUE 3875.
           05 FILLER PIC 9(4) COMP-5 VALUE 598.
           05 FILLER PIC 9(4) COMP-5 VALUE 298.
           05 FILLER PIC 9(4) COMP-5 VALUE 1513.
           05 FILLER PIC 9(4) COMP-5 VALUE 3479.
           05 FILLER PIC 9(4) COMP-5 VALUE 821.
           05 FILLER PIC 9(4) COMP-5 VALUE 2542.
           05 FILLER PIC 9(4) COMP-5 VALUE 236.
           05 FILLER PIC 9(4) COMP-5 VALUE 3955.
           05 FILLER PIC 9(4) COMP-5 VALUE 1743.
           05 FILLER PIC 9(4) COMP-5 VALUE 1323.
           05 FILLER PIC 9(4) COMP-5 VALUE 280.
           05 FILLER PIC 9(4) COMP-5 VALUE 3447.
           05 FILLER PIC 9(4) COMP-5 VALUE 1830.
           05 FILLER PIC 9(4) COMP-5 VALUE 2936.
           05 FILLER PIC 9(4) COMP-5 VALUE 337.
           05 FILLER PIC 9(4) COMP-5 VALUE 1621.
           05 FILLER PIC 9(4) COMP-5 VALUE 1830.
           05 FILLER PIC 9(4) COMP-5 VALUE 3373.
           05 FILLER PIC 9(4) COMP-5 VALUE 1646.
           05 FILLER PIC 9(4) COMP-5 VALUE 1393.
           05 FILLER PIC 9(4) COMP-5 VALUE 1368.
           05 FILLER PIC 9(4) COMP-5 VALUE 3874.
           05 FILLER PIC 9(4) COMP-5 VALUE 1318.
           05 FILLER PIC 9(4) COMP-5 VALUE 938.
           05 FILLER PIC 9(4) COMP-5 VALUE 955.
           05 FILLER PIC 9(4) COMP-5 VALUE 3022.
           05 FILLER PIC 9(4) COMP-5 VALUE 474.
           05 FILLER PIC 9(4) COMP-5 VALUE 2482.
           05 FILLER PIC 9(4) COMP-5 VALUE 1183.
           05 FILLER PIC 9(4) COMP-5 VALUE 3854.
           05 FILLER PIC 9(4) COMP-5 VALUE 923.
           05 FILLER PIC 9(4) COMP-5 VALUE 376.
           05 FILLER PIC 9(4) COMP-5 VALUE 825.
           05 FILLER PIC 9(4) COMP-5 VALUE 2519.
           05 FILLER PIC 9(4) COMP-5 VALUE 135.
           05 FILLER PIC 9(4) COMP-5 VALUE 2945.
           05 FILLER PIC 9(4) COMP-5 VALUE 1622.
           05 FILLER PIC 9(4) COMP-5 VALUE 953.
           05 FILLER PIC 9(4) COMP-5 VALUE 268.
           05 FILLER PIC 9(4) COMP-5 VALUE 2628.
           05 FILLER PIC 9(4) COMP-5 VALUE 1479.
           05 FILLER PIC 9(4) COMP-5 VALUE 2097.
           05 FILLER PIC 9(4) COMP-5 VALUE 981.
           05 FILLER PIC 9(4) COMP-5 VALUE 890.
           05 FILLER PIC 9(4) COMP-5 VALUE 1846.
           05 FILLER PIC 9(4) COMP-5 VALUE 2139.
           05 FILLER PIC 9(4) COMP-5 VALUE 1806.
           05 FILLER PIC 9(4) COMP-5 VALUE 2421.
           05 FILLER PIC 9(4) COMP-5 VALUE 1007.
           05 FILLER PIC 9(4) COMP-5 VALUE 2290.
           05 FILLER PIC 9(4) COMP-5 VALUE 1810.
           05 FILLER PIC 9(4) COMP-5 VALUE 1115.
           05 FILLER PIC 9(4) COMP-5 VALUE 1052.
           05 FILLER PIC 9(4) COMP-5 VALUE 2588.
           05 FILLER PIC 9(4) COMP-5 VALUE 302.
           05 FILLER PIC 9(4) COMP-5 VALUE 327.
           05 FILLER PIC 9(4) COMP-5 VALUE 265.
           05 FILLER PIC 9(4) COMP-5 VALUE 241.
           05 FILLER PIC 9(4) COMP-5 VALUE 341.
           05 FILLER PIC 9(4) COMP-5 VALUE 1917.
           05 FILLER PIC 9(4) COMP-5 VALUE 687.
           05 FILLER PIC 9(4) COMP-5 VALUE 2991.
           05 FILLER PIC 9(4) COMP-5 VALUE 792.
           05 FILLER PIC 9(4) COMP-5 VALUE 2573.
           05 FILLER PIC 9(4) COMP-5 VALUE 599.
           05 FILLER PIC 9(4) COMP-5 VALUE 19.
           05 FILLER PIC 9(4) COMP-5 VALUE 674.
           05 FILLER PIC 9(4) COMP-5 VALUE 3911.
           05 FILLER PIC 9(4) COMP-5 VALUE 1673.
           05 FILLER PIC 9(4) COMP-5 VALUE 872.
           05 FILLER PIC 9(4) COMP-5 VALUE 1559.
           05 FILLER PIC 9(4) COMP-5 VALUE 2863.
           05 FILLER PIC 9(4) COMP-5 VALUE 558.
           05 FILLER PIC 9(4) COMP-5 VALUE 929.
           05 FILLER PIC 9(4) COMP-5 VALUE 1766.
           05 FILLER PIC 9(4) COMP-5 VALUE 839.
           05 FILLER PIC 9(4) COMP-5 VALUE 620.
           05 FILLER PIC 9(4) COMP-5 VALUE 3893.
           05 FILLER PIC 9(4) COMP-5 VALUE 102.
           05 FILLER PIC 9(4) COMP-5 VALUE 2178.
           05 FILLER PIC 9(4) COMP-5 VALUE 1619.
           05 FILLER PIC 9(4) COMP-5 VALUE 3822.
           05 FILLER PIC 9(4) COMP-5 VALUE 899.
           05 FILLER PIC 9(4) COMP-5 VALUE 378.
           05 FILLER PIC 9(4) COMP-5 VALUE 1048.
           05 FILLER PIC 9(4) COMP-5 VALUE 1178.
           05 FILLER PIC 9(4) COMP-5 VALUE 100.
           05 FILLER PIC 9(4) COMP-5 VALUE 2599.
           05 FILLER PIC 9(4) COMP-5 VALUE 901.
           05 FILLER PIC 9(4) COMP-5 VALUE 3416.
           05 FILLER PIC 9(4) COMP-5 VALUE 143.
           05 FILLER PIC 9(4) COMP-5 VALUE 2961.
           05 FILLER PIC 9(4) COMP-5 VALUE 1605.
           05 FILLER PIC 9(4) COMP-5 VALUE 611.
           05 FILLER PIC 9(4) COMP-5 VALUE 1384.
           05 FILLER PIC 9(4) COMP-5 VALUE 3113.
           05 FILLER PIC 9(4) COMP-5 VALUE 885.
           05 FILLER PIC 9(4) COMP-5 VALUE 2597.
           05 FILLER PIC 9(4) COMP-5 VALUE 1830.
           05 FILLER PIC 9(4) COMP-5 VALUE 2586.
           05 FILLER PIC 9(4) COMP-5 VALUE 1286.
           05 FILLER PIC 9(4) COMP-5 VALUE 161.
           05 FILLER PIC 9(4) COMP-5 VALUE 906.
           05 FILLER PIC 9(4) COMP-5 VALUE 1429.
           05 FILLER PIC 9(4) COMP-5 VALUE 134.
           05 FILLER PIC 9(4) COMP-5 VALUE 742.
           05 FILLER PIC 9(4) COMP-5 VALUE 1025.
           05 FILLER PIC 9(4) COMP-5 VALUE 1625.
           05 FILLER PIC 9(4) COMP-5 VALUE 1651.
           05 FILLER PIC 9(4) COMP-5 VALUE 1187.
           05 FILLER PIC 9(4) COMP-5 VALUE 706.
           05 FILLER PIC 9(4) COMP-5 VALUE 1787.
           05 FILLER PIC 9(4) COMP-5 VALUE 1009.
           05 FILLER PIC 9(4) COMP-5 VALUE 22.
           05 FILLER PIC 9(4) COMP-5 VALUE 987.
           05 FILLER PIC 9(4) COMP-5 VALUE 3640.
           05 FILLER PIC 9(4) COMP-5 VALUE 43.
           05 FILLER PIC 9(4) COMP-5 VALUE 3756.
           05 FILLER PIC 9(4) COMP-5 VALUE 882.
           05 FILLER PIC 9(4) COMP-5 VALUE 776.
           05 FILLER PIC 9(4) COMP-5 VALUE 392.
           05 FILLER PIC 9(4) COMP-5 VALUE 1724.
           05 FILLER PIC 9(4) COMP-5 VALUE 1642.
           05 FILLER PIC 9(4) COMP-5 VALUE 198.
           05 FILLER PIC 9(4) COMP-5 VALUE 1810.
           05 FILLER PIC 9(4) COMP-5 VALUE 3950.
           05 FILLER PIC 9(4) COMP-5 VALUE 1558.

01  POINTS-VALS REDEFINES POINTS-DATA.
    05 POINT-COORD OCCURS 100 TIMES INDEXED BY P-IDX.
        10 P-X PIC 9(4) COMP-5.
        10 P-Y PIC 9(4) COMP-5.

01  DISTANCE-MATRIX.
    05 DIST-ROW OCCURS 100 TIMES.
        10 DIST OCCURS 100 TIMES USAGE COMP-2.

01  EDGES-DATA.
    05 NUM-EDGES PIC 9(5) BINARY VALUE 0.
    05 EDGE OCCURS 5000 TIMES INDEXED BY E-IDX.
        10 E-U PIC 9(4) BINARY.
        10 E-V PIC 9(4) BINARY.
        10 E-W USAGE COMP-2.

01  MST-DATA.
    05 NUM-MST PIC 9(4) BINARY VALUE 0.
    05 MST-EDGE OCCURS 100 TIMES.
        10 M-U PIC 9(4) BINARY.
        10 M-V PIC 9(4) BINARY.
        10 M-W USAGE COMP-2.

01  UNION-FIND-DATA.
    05 UF-PARENT OCCURS 100 TIMES PIC 9(4) BINARY.
    05 UF-RANK OCCURS 100 TIMES PIC 9(4) BINARY.

01  ODD-VERTICES-DATA.
    05 NUM-ODD PIC 9(4) BINARY VALUE 0.
    05 ODD-V OCCURS 100 TIMES PIC 9(4) BINARY.
    05 VISITED-ODD OCCURS 100 TIMES PIC 9 BINARY.

01  DEGREES-DATA.
    05 DEG-V OCCURS 100 TIMES PIC 9(4) BINARY.

01  MWM-DATA.
    05 NUM-MWM PIC 9(4) BINARY VALUE 0.
    05 MWM-EDGE OCCURS 300 TIMES.
        10 W-U PIC 9(4) BINARY.
        10 W-V PIC 9(4) BINARY.
        10 W-W USAGE COMP-2.

01  ADJ-DATA.
    05 ADJ-ROW OCCURS 100 TIMES.
        10 ADJ-COUNT PIC 9(4) BINARY VALUE 0.
        10 ADJ-EDGE OCCURS 100 TIMES.
            15 A-V PIC 9(4) BINARY.
            15 A-IDX PIC 9(4) BINARY.

01  EULERIAN-DATA.
    05 EDGES-USED OCCURS 300 TIMES PIC 9 BINARY.
    05 STACK-DATA.
        10 STACK-TOP PIC 9(4) BINARY VALUE 0.
        10 STACK-V OCCURS 500 TIMES PIC 9(4) BINARY.
    05 CIRCUIT-DATA.
        10 NUM-CIRC PIC 9(4) BINARY VALUE 0.
        10 CIRC-V OCCURS 500 TIMES PIC 9(4) BINARY.

01  HAMILTONIAN-DATA.
    05 PATH-DATA.
        10 NUM-PATH PIC 9(4) BINARY VALUE 0.
        10 PATH-V OCCURS 100 TIMES PIC 9(4) BINARY.
    05 PATH-VISITED OCCURS 100 TIMES PIC 9 BINARY.
    05 PATH-LENGTH USAGE COMP-2 VALUE 0.

01  TEMP-VARS.
    05 I PIC 9(5) BINARY.
    05 J PIC 9(5) BINARY.
    05 K PIC 9(5) BINARY.
    05 IDX PIC 9(5) BINARY.
    05 U PIC 9(4) BINARY.
    05 V PIC 9(4) BINARY.
    05 W USAGE COMP-2.
    05 ROOT-U PIC 9(4) BINARY.
    05 ROOT-V PIC 9(4) BINARY.
    05 MIN-D USAGE COMP-2.
    05 CLOSEST-U PIC 9(4) BINARY.
    05 CLOSEST-J PIC 9(4) BINARY.
    05 CURR-V PIC 9(4) BINARY.
    05 NXT-V PIC 9(4) BINARY.
    05 FOUND-EDGE PIC 9 BINARY.
    05 OUT-DISP PIC Z(4)9.
    05 OUT-FLOAT PIC -,---,--9.99.
    05 X-DIFF USAGE COMP-2.
    05 Y-DIFF USAGE COMP-2.
    05 TEMP-U PIC 9(4) BINARY.
    05 TEMP-V PIC 9(4) BINARY.
    05 TEMP-W USAGE COMP-2.
    05 SORT-I PIC 9(5) BINARY.
    05 SORT-J PIC 9(5) BINARY.
    05 P-U PIC 9(4) BINARY.
    05 OUT-STR PIC X(2000).
    05 STR-PTR PIC 9(5) BINARY VALUE 1.
    05 START-IDX PIC 9(5) BINARY.
    05 SUB-IDX PIC 9(5) BINARY.
    05 TEMP-LEN PIC 9(5) BINARY.

PROCEDURE DIVISION.
MAIN-LOGIC.
    PERFORM CALC-DISTANCES.
    PERFORM FIND-MST.
    PERFORM FIND-ODD.
    PERFORM FIND-MWM.
    PERFORM FIND-EULERIAN.
    PERFORM FIND-HAMILTONIAN.
    STOP RUN.

CALC-DISTANCES.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > WS-N
        PERFORM VARYING J FROM 1 BY 1 UNTIL J > WS-N
            IF I = J
                MOVE 0 TO DIST(I, J)
            ELSE
                COMPUTE X-DIFF = P-X(I)
                COMPUTE X-DIFF = X-DIFF - P-X(J)
                COMPUTE Y-DIFF = P-Y(I)
                COMPUTE Y-DIFF = Y-DIFF - P-Y(J)
                COMPUTE DIST(I, J) = (X-DIFF * X-DIFF + Y-DIFF * Y-DIFF) ** 0.5
            END-IF
        END-PERFORM
    END-PERFORM.

FIND-MST.
    MOVE 0 TO NUM-EDGES.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > WS-N
        COMPUTE J = I + 1
        PERFORM VARYING J FROM J BY 1 UNTIL J > WS-N
            ADD 1 TO NUM-EDGES
            MOVE I TO E-U(NUM-EDGES)
            MOVE J TO E-V(NUM-EDGES)
            MOVE DIST(I, J) TO E-W(NUM-EDGES)
        END-PERFORM
    END-PERFORM.

    *> Shell sort gap sequence
    MOVE NUM-EDGES TO K
    PERFORM UNTIL K = 0
        COMPUTE K = K / 2
        IF K > 0
            COMPUTE START-IDX = K + 1
            PERFORM VARYING I FROM START-IDX BY 1 UNTIL I > NUM-EDGES
                MOVE E-U(I) TO TEMP-U
                MOVE E-V(I) TO TEMP-V
                MOVE E-W(I) TO TEMP-W
                MOVE I TO J

                PERFORM UNTIL J <= K
                    COMPUTE SUB-IDX = J - K
                    IF E-W(SUB-IDX) <= TEMP-W
                        EXIT PERFORM
                    END-IF
                    MOVE E-U(SUB-IDX) TO E-U(J)
                    MOVE E-V(SUB-IDX) TO E-V(J)
                    MOVE E-W(SUB-IDX) TO E-W(J)
                    COMPUTE J = J - K
                END-PERFORM

                MOVE TEMP-U TO E-U(J)
                MOVE TEMP-V TO E-V(J)
                MOVE TEMP-W TO E-W(J)
            END-PERFORM
        END-IF
    END-PERFORM.

    *> Initialize Union-Find
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > WS-N
        MOVE I TO UF-PARENT(I)
        MOVE 0 TO UF-RANK(I)
    END-PERFORM.

    MOVE 0 TO NUM-MST.
    PERFORM VARYING K FROM 1 BY 1 UNTIL K > NUM-EDGES
        MOVE E-U(K) TO U
        MOVE E-V(K) TO V
        PERFORM FIND-SET-U
        PERFORM FIND-SET-V
        IF ROOT-U NOT = ROOT-V
            ADD 1 TO NUM-MST
            MOVE U TO M-U(NUM-MST)
            MOVE V TO M-V(NUM-MST)
            MOVE E-W(K) TO M-W(NUM-MST)
            PERFORM UNION-SET
            IF NUM-MST = WS-N - 1
                EXIT PERFORM
            END-IF
        END-IF
    END-PERFORM.

    DISPLAY "Minimum spanning tree: ".
    MOVE M-W(1) TO OUT-FLOAT.
    DISPLAY "MST First Edge Weight: " OUT-FLOAT.

FIND-SET-U.
    MOVE U TO CURR-V.
    PERFORM UNTIL UF-PARENT(CURR-V) = CURR-V
        MOVE UF-PARENT(CURR-V) TO CURR-V
    END-PERFORM.
    MOVE CURR-V TO ROOT-U.
    MOVE U TO CURR-V.
    PERFORM UNTIL UF-PARENT(CURR-V) = ROOT-U
        MOVE UF-PARENT(CURR-V) TO NXT-V
        MOVE ROOT-U TO UF-PARENT(CURR-V)
        MOVE NXT-V TO CURR-V
    END-PERFORM.

FIND-SET-V.
    MOVE V TO CURR-V.
    PERFORM UNTIL UF-PARENT(CURR-V) = CURR-V
        MOVE UF-PARENT(CURR-V) TO CURR-V
    END-PERFORM.
    MOVE CURR-V TO ROOT-V.
    MOVE V TO CURR-V.
    PERFORM UNTIL UF-PARENT(CURR-V) = ROOT-V
        MOVE UF-PARENT(CURR-V) TO NXT-V
        MOVE ROOT-V TO UF-PARENT(CURR-V)
        MOVE NXT-V TO CURR-V
    END-PERFORM.

UNION-SET.
    IF UF-RANK(ROOT-U) < UF-RANK(ROOT-V)
        MOVE ROOT-V TO UF-PARENT(ROOT-U)
    ELSE
        IF UF-RANK(ROOT-U) > UF-RANK(ROOT-V)
            MOVE ROOT-U TO UF-PARENT(ROOT-V)
        ELSE
            MOVE ROOT-U TO UF-PARENT(ROOT-V)
            ADD 1 TO UF-RANK(ROOT-U)
        END-IF
    END-IF.

FIND-ODD.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > WS-N
        MOVE 0 TO DEG-V(I)
    END-PERFORM.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM-MST
        MOVE M-U(I) TO U
        MOVE M-V(I) TO V
        ADD 1 TO DEG-V(U)
        ADD 1 TO DEG-V(V)
    END-PERFORM.

    MOVE 0 TO NUM-ODD.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > WS-N
        IF FUNCTION MOD(DEG-V(I) 2) = 1
            ADD 1 TO NUM-ODD
            MOVE I TO ODD-V(NUM-ODD)
        END-IF
    END-PERFORM.
    DISPLAY "Odd vertices count: " NUM-ODD.

FIND-MWM.
    MOVE 0 TO NUM-MWM.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM-MST
        ADD 1 TO NUM-MWM
        MOVE M-U(I) TO W-U(NUM-MWM)
        MOVE M-V(I) TO W-V(NUM-MWM)
        MOVE M-W(I) TO W-W(NUM-MWM)
    END-PERFORM.

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM-ODD
        MOVE 0 TO VISITED-ODD(I)
    END-PERFORM.

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM-ODD
        IF VISITED-ODD(I) = 0
            MOVE ODD-V(I) TO U
            MOVE 99999999 TO MIN-D
            MOVE 0 TO CLOSEST-J
            COMPUTE J = I + 1
            PERFORM VARYING J FROM J BY 1 UNTIL J > NUM-ODD
                IF VISITED-ODD(J) = 0
                    MOVE ODD-V(J) TO V
                    IF DIST(U, V) < MIN-D
                        MOVE DIST(U, V) TO MIN-D
                        MOVE J TO CLOSEST-J
                        MOVE V TO CLOSEST-U
                    END-IF
                END-IF
            END-PERFORM

            IF CLOSEST-J > 0
                ADD 1 TO NUM-MWM
                MOVE U TO W-U(NUM-MWM)
                MOVE CLOSEST-U TO W-V(NUM-MWM)
                MOVE MIN-D TO W-W(NUM-MWM)
                MOVE 1 TO VISITED-ODD(I)
                MOVE 1 TO VISITED-ODD(CLOSEST-J)
            END-IF
        END-IF
    END-PERFORM.

FIND-EULERIAN.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > WS-N
        MOVE 0 TO ADJ-COUNT(I)
    END-PERFORM.

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM-MWM
        MOVE 0 TO EDGES-USED(I)
        MOVE W-U(I) TO U
        MOVE W-V(I) TO V
        ADD 1 TO ADJ-COUNT(U)
        MOVE V TO A-V(U, ADJ-COUNT(U))
        MOVE I TO A-IDX(U, ADJ-COUNT(U))
        ADD 1 TO ADJ-COUNT(V)
        MOVE U TO A-V(V, ADJ-COUNT(V))
        MOVE I TO A-IDX(V, ADJ-COUNT(V))
    END-PERFORM.

    MOVE 0 TO NUM-CIRC.
    MOVE 0 TO STACK-TOP.
    MOVE W-U(1) TO CURR-V.
    ADD 1 TO STACK-TOP.
    MOVE CURR-V TO STACK-V(STACK-TOP).

    PERFORM UNTIL STACK-TOP = 0
        MOVE STACK-V(STACK-TOP) TO CURR-V
        MOVE 0 TO FOUND-EDGE

        PERFORM VARYING I FROM ADJ-COUNT(CURR-V) BY -1 UNTIL I = 0 OR FOUND-EDGE = 1
            MOVE A-IDX(CURR-V, I) TO IDX
            IF EDGES-USED(IDX) = 0
                MOVE 1 TO EDGES-USED(IDX)
                MOVE A-V(CURR-V, I) TO NXT-V
                ADD 1 TO STACK-TOP
                MOVE NXT-V TO STACK-V(STACK-TOP)
                MOVE 1 TO FOUND-EDGE
                SUBTRACT 1 FROM ADJ-COUNT(CURR-V)
            ELSE
                SUBTRACT 1 FROM ADJ-COUNT(CURR-V)
            END-IF
        END-PERFORM

        IF FOUND-EDGE = 0
            ADD 1 TO NUM-CIRC
            MOVE CURR-V TO CIRC-V(NUM-CIRC)
            SUBTRACT 1 FROM STACK-TOP
        END-IF
    END-PERFORM.

    COMPUTE K = NUM-CIRC / 2
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > K
        COMPUTE J = NUM-CIRC - I + 1
        MOVE CIRC-V(I) TO TEMP-U
        MOVE CIRC-V(J) TO CIRC-V(I)
        MOVE TEMP-U TO CIRC-V(J)
    END-PERFORM.

FIND-HAMILTONIAN.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > WS-N
        MOVE 0 TO PATH-VISITED(I)
    END-PERFORM.

    MOVE 0 TO NUM-PATH.
    MOVE 0 TO PATH-LENGTH.

    MOVE CIRC-V(1) TO CURR-V.
    ADD 1 TO NUM-PATH.
    MOVE CURR-V TO PATH-V(NUM-PATH).
    MOVE 1 TO PATH-VISITED(CURR-V).

    PERFORM VARYING I FROM 2 BY 1 UNTIL I > NUM-CIRC
        MOVE CIRC-V(I) TO NXT-V
        IF PATH-VISITED(NXT-V) = 0
            ADD 1 TO NUM-PATH
            MOVE NXT-V TO PATH-V(NUM-PATH)
            MOVE 1 TO PATH-VISITED(NXT-V)
            COMPUTE PATH-LENGTH = PATH-LENGTH + DIST(CURR-V, NXT-V)
            MOVE NXT-V TO CURR-V
        END-IF
    END-PERFORM.

    MOVE PATH-V(1) TO NXT-V.
    COMPUTE PATH-LENGTH = PATH-LENGTH + DIST(CURR-V, NXT-V).
    ADD 1 TO NUM-PATH.
    MOVE NXT-V TO PATH-V(NUM-PATH).

    MOVE 1 TO STR-PTR.
    STRING "Result path: [" INTO OUT-STR POINTER STR-PTR.

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM-PATH
        COMPUTE P-U = PATH-V(I) - 1
        MOVE P-U TO OUT-DISP
        STRING OUT-DISP DELIMITED BY SIZE INTO OUT-STR POINTER STR-PTR
        IF I < NUM-PATH
            STRING ", " DELIMITED BY SIZE INTO OUT-STR POINTER STR-PTR
        END-IF
    END-PERFORM.
    STRING "]" DELIMITED BY SIZE INTO OUT-STR POINTER STR-PTR.

    COMPUTE TEMP-LEN = STR-PTR - 1.
    IF TEMP-LEN > 0
        DISPLAY OUT-STR(1:TEMP-LEN)
    ELSE
        DISPLAY OUT-STR
    END-IF.

    MOVE PATH-LENGTH TO OUT-FLOAT.
    DISPLAY "Length of the result path: " OUT-FLOAT.

