x = 'alphaBETA'                       /*define string to a REXX variable*/
y = upper(x)                          /*uppercase  X  and store it───► Y*/
z = lower(x)                          /*lowercase  X   "    "   " ───► Z*/

                            /*Some REXXes don't support the  UPPER  and */
                            /*  LOWER  BIFs  (built-in functions).      */
