   declare a(5,6) fixed;
   declare b(3,4) fixed defined a(1sub, 2sub);
   declare c(2,2) fixed defined a(1sub+hbound(b,1), 2sub+hbound(b,2));
   declare (i, j, k) fixed;

   a = 0;
   put skip list ('Please type elements for a 3 x 4 matrix:');
   get list (b);
   put skip list ('Please type elements for a 2 x 2 matrix:');
   get list (c);
   put skip edit (c) ( skip, (hbound(c,2)) f(5,0) );

   put skip list ('Composite matrix:');
   put skip edit (a) ( skip, (hbound(a,2)) f(5,0) );
