include Settings

say 'REAL CONSTANTS AND FUNCTIONS - 2 Mar 2025'
say version
say
numeric digits 16
say 'e             =' e()+0
say 'pi            =' pi()+0
say 'square root 7 =' sqrt(7)+0
say 'log 7 base e  =' log(7)+0
say 'log 7 base 10 =' log10(7)+0
say 'log 7 base 2  =' logxy(7,2)+0
say 'exponential 7 =' exp(7)+0
say '1/2^3/4       =' power(1/2,3/4)+0
say 'floor 4/3     =' floor(4/3)
say 'ceiling 4/3   =' ceil(4/3)
exit

include Functions
include Constants
include Abend
