convert: procedure (N, base) returns (character (64) varying) recursive;
   declare N fixed binary (31), base fixed binary;
   declare table (0:15) character (
      '0', '1', '2', '3', '4', '5', '6', '7',
      '8', '9', 'a', 'b', 'c', 'd', 'e', 'f');
   declare s character (64) varying;

   if N = 0 then return ('');

   s = convert(N/base, base);
   return (s || table(mod(N, base)) );
end convert;
